#### EnergyAnalysisOpeningType Enumeration

---

|  |
| --- |
| See Also |

Energy analysis opening type.

Analytical opening types.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum EnergyAnalysisOpeningType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration EnergyAnalysisOpeningType ``` |

| Visual C++ |
| --- |
| ``` public enum class EnergyAnalysisOpeningType ``` |

# Members

| Member name | Description |
| --- | --- |
| Door | Door. |
| Window | Window. |
| Skylight | Skylight. |
| Air | Air. |

# See Also

Autodesk.Revit.DB.Analysis Namespace